app/controllers/pulses_controller.rb

SELECT "pulses".* FROM "pulses"   ORDER BY updated_at DESC
SELECT  "pulses".* FROM "pulses"   ORDER BY updated_at DESC LIMIT 10
---
  def index
    @pulses = Pulse.all.order('updated_at DESC')
     respond_to do |format|
       format.html {  }
       @pulses = @pulses.limit(10)

INSERT INTO "pulses" ("created_at", "pulse_rate", "pulse_time", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-18 07:28:41.251165"], ["pulse_rate", 50], ["pulse_time", "2015-03-18 07:28:00.000000"], ["updated_at", "2015-03-18 07:28:41.251165"]]
---
  def create

    unless params[:pulse]
      params[:pulse] = params
    end
    @pulse = Pulse.new(pulse_params)

    respond_to do |format|
      if @pulse.save

INSERT INTO "pulses" ("created_at", "pulse_rate", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-03-18 08:46:05.785293"], ["pulse_rate", 51], ["updated_at", "2015-03-18 08:46:05.785293"]]
---
  def create_pulse
    Pulse.create(pulse_rate: params[:B])

SELECT  "pulses".* FROM "pulses"  WHERE "pulses"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_pulse
      @pulse = Pulse.find(params[:id])