app/controllers/temperatures_controller.rb

  def index
    @temperatures = Temperature.all.order('updated_at DESC')
     respond_to do |format|
       format.html {  }
       @temperatures = @temperatures.limit(10)
---
SELECT "temperatures".* FROM "temperatures"   ORDER BY updated_at DESC
SELECT  "temperatures".* FROM "temperatures"   ORDER BY updated_at DESC LIMIT 10

  def create

    unless params[:temperature]
      params[:temperature] = params
    end
    @temperature = Temperature.new(temperature_params)

    respond_to do |format|
      if @temperature.save
---
INSERT INTO "temperatures" ("celcius", "created_at", "farenhiet", "temp_time", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["celcius", 23.0], ["created_at", "2015-03-11 12:52:01.066820"], ["farenhiet", 123.0], ["temp_time", "2015-03-11 12:51:00.000000"], ["updated_at", "2015-03-11 12:52:01.066820"]]

  def create_temp
    p "_____________________________"
    Temperature.create(celcius: params[:Te], farenhiet: params[:Fa])
---
INSERT INTO "temperatures" ("celcius", "created_at", "farenhiet", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["celcius", 223.0], ["created_at", "2015-03-11 13:45:54.841466"], ["farenhiet", 245.0], ["updated_at", "2015-03-11 13:45:54.841466"]]

  def destroy
    @temperature.destroy
---
DELETE FROM "temperatures" WHERE "temperatures"."id" = $1  [["id", 1]]

    def set_temperature
      @temperature = Temperature.find(params[:id])
---
SELECT  "temperatures".* FROM "temperatures"  WHERE "temperatures"."id" = $1 LIMIT 1  [["id", 1]]